Autodesk.Revit.DB.FillPattern.ExportToPAT(System.Collections.Generic.IList{Autodesk.Revit.DB.FillPattern},System.String)
Export a list of FillPatterns to an AutoCAD PAT file.
Remarks:
The built-in Solid Fill pattern cannot be expressed in this format.
The PAT file format is ASCII based. FillPatterns with names that contain non-ASCII characters will be exported as 'Pattern_###'.
The original name is exported in the description field of the PAT format, encoded as UTF-8.
fillPatterns:
A list of FillPatterns to export.
filename:
The full path of the file to export to.
Returns:
True if all patterns were exported successfully,
False if export of any pattern failed.
Throws Autodesk.Revit.Exceptions.ArgumentException:
filename is an empty string.
-or-
fillPatterns is empty.
-or-
fillPatterns contains the solid fill pattern.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentAlreadyExistsException:
filename is pointing to a folder that already exists and cannot be deleted.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The destination file name includes one or more invalid characters.
Since:
2024.2